a1 = str(input("Введите 1 этап развития человека: "));
a2 = str(input("Введите 2 этап развития человека: "));
a3 = str(input("Введите 3 этап развития человека: "));
a4 = str(input("Введите 4 этап развития человека: "));
a5 = str(input("Введите 5 этап развития человека: "));
a6 = str(input("Введите 6 этап развития человека: "));

print(a1,a2,a3,a4,a5,a6, sep=" => ");

# 6 этапов развития человека: Дриопитек, Австралопитек, Человек прямоходящий, Неандерталец, Кроманьонец, Человек разумный Homo sapiens.